Revit 2027 API
ParameterTypeId.LineShapeAtCorner Property
 "Line Shape at Landing Corner"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LineShapeAtCorner { get; }
Public Shared ReadOnly Property LineShapeAtCorner As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LineShapeAtCorner {
	ForgeTypeId^ get ();
}
static member LineShapeAtCorner : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace